In [1]:
import pandas as pd
import numpy as np
# create data
stuff = {
    "Corporation":['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
    "Employees": ['John', 'Shadab', 'Wes', 'Beth', 'Justin', 'Steph'],
    "Salary": [200, 220, 190, 130, 120, 150]
}
# create dataframe
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google    Shadab     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [10]:
# Create function
# format() is for commas
def times1000(x):
    return format(x*1000, ",d")

In [11]:
# use apply function
my_df["Salary"].apply(times1000)

0    200,000
1    220,000
2    190,000
3    130,000
4    120,000
5    150,000
Name: Salary, dtype: object

In [12]:
# make it into a dataframe
pd.DataFrame(my_df["Salary"].apply(times1000))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000

In [14]:
# Add last name
def namer(x):
    if x=="Shadab":
        return "Shadab Hasan"
    else:
        return "Not important"

In [15]:
my_df["Employees"].apply(namer)

0    Not important
1     Shadab Hasan
2    Not important
3    Not important
4    Not important
5    Not important
Name: Employees, dtype: object

In [17]:
# use lambda
pd.DataFrame(my_df["Salary"].apply(lambda x: format(x*1000, ",d")))

    Salary
0  200,000
1  220,000
2  190,000
3  130,000
4  120,000
5  150,000

In [18]:
# append to current df
my_df["Salary"] = my_df["Salary"].apply(times1000)
my_df

  Corporation Employees   Salary
0       Apple      John  200,000
1      Google    Shadab  220,000
2        Meta       Wes  190,000
3       Apple      Beth  130,000
4      Google    Justin  120,000
5        Meta     Steph  150,000

In [19]:
# function on multiple columns
def nameadder(x):
    return "Go " + x

In [21]:
my_df[["Corporation", "Employees"]].apply(nameadder)

  Corporation  Employees
0    Go Apple    Go John
1   Go Google  Go Shadab
2     Go Meta     Go Wes
3    Go Apple    Go Beth
4   Go Google  Go Justin
5     Go Meta   Go Steph

In [24]:
# apply to current df
my_df[["Corporation", "Employees"]] = my_df[["Corporation", "Employees"]].apply(nameadder)
my_df

       Corporation        Employees   Salary
0   Go Go Go Apple    Go Go Go John  200,000
1  Go Go Go Google  Go Go Go Shadab  220,000
2    Go Go Go Meta     Go Go Go Wes  190,000
3   Go Go Go Apple    Go Go Go Beth  130,000
4  Go Go Go Google  Go Go Go Justin  120,000
5    Go Go Go Meta   Go Go Go Steph  150,000